app/controllers/classs_controller.rb

SELECT `classses`.* FROM `classses`
---
  def index
    @classs = Classs.all