app/controllers/duong_controller.rb

  def index
    @duong = Duong.all
---
SELECT `duongs`.* FROM `duongs`