app/controllers/student_controller.rb

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
DELETE FROM `students` WHERE `students`.`id` = 21