app/controllers/student_controller.rb

  def index
    @student = Student.all
    @student_page = Student.page(params[:page]).per(10)
    if params[:query].present?
      @student = Student.where("student_code LIKE ?", "%#{params[:query]}%")
---
SELECT `students`.* FROM `students` WHERE (student_name LIKE '%CODE_42227777%')
SELECT COUNT(*) FROM `students`
SELECT `students`.* FROM `students` LIMIT 11
SELECT `students`.`id` FROM `students` WHERE (student_code LIKE '%cod%')

  def back_to_show
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 5 LIMIT 1

  def show
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 5 LIMIT 1

  def create
    @student = Student.new(student_params)
    if @student.save
---
INSERT INTO `students` (`student_code`, `student_name`, `date_of_birth`, `address`, `gmail`, `phone`, `created_at`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, NULL, '2024-03-07 10:38:06.767856', '2024-03-07 10:38:06.767856')

  def edit
    @student =Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 22 LIMIT 1

  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 18 LIMIT 1
UPDATE `students` SET `students`.`student_code` = 'CODE_4222', `students`.`updated_at` = '2024-03-08 06:51:47.764235' WHERE `students`.`id` = 5

  def destroy
    @student = Student.find(params[:id])
    @student.destroy
---
SELECT `students`.* FROM `students` WHERE `students`.`id` = 24 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 24

  def set_student
    @student = Student.find(params[:id])
---
SELECT `students`.* FROM `students` WHERE (student_name LIKE '%Name: 222%')