app/controllers/teacher_controller.rb

  def index
    @teacher = Teacher.all
    @teacher_page = Teacher.page(params[:page]).per(10)
    if params[:query].present?
      @ids = Teacher.where("teacher_code LIKE ?", "%#{params[:query]}%").ids
---
SELECT `teachers`.`id` FROM `teachers` WHERE (teacher_code LIKE '%CODE_9%')
SELECT COUNT(*) FROM `teachers`
SELECT `teachers`.* FROM `teachers` LIMIT 10 OFFSET 0
SELECT `teachers`.`id` FROM `teachers` WHERE (teacher_code LIKE '%CODE_20%')

  def create
    @teacher = Teacher.new(teacher_params)
    if @teacher.save
---
INSERT INTO `teachers` (`teacher_code`, `teacher_name`, `date_of_birth`, `gender`, `gmail`, `phone`, `created_at`, `updated_at`) VALUES ('we', 'wew', NULL, 'e', 'wew', 0, '2024-03-08 07:40:39.349057', '2024-03-08 07:40:39.349057')

  def destroy
    @teacher = Teacher.find(params[:id])
    @teacher.destroy
---
SELECT `teachers`.* FROM `teachers` WHERE `teachers`.`id` = 21 LIMIT 1
DELETE FROM `teachers` WHERE `teachers`.`id` = 21