app/controllers/transcript_controller.rb

  def index
    @transcript = Transcript.all
---
SELECT `transcripts`.* FROM `transcripts`