app/controllers/tuition_controller.rb

  def index
    @tuition = Tuition.all
---
SELECT `tuitions`.* FROM `tuitions`